#include <iostream>

int square(int x) {
    // Принимаем число x на вход и возвращаем квадрат этого числа
    return x * x;
}

double triangle(int h, int n) {
    /*
    Возвращаем площадь треугольника

    Параметры:
        int h - длина высоты треугольника
        int n - длина стороны треугольника, на которую падает данная высота
    
    Возвращаемое значение:
        double - площадь треугольника в виде вещественного числа
    */
    return h * n / 2;
}

int main() {
    // Запрашиваем у пользователя параметры и возвращаем результат работы функции
    std::cout << "Введите длину стороны квадрата\n";
    int a = 0;
    std::cin >> a;
    std::cout << "Площадь квадрата: " << square(a) << '\n';
    std::cout << "Введите длину высоты, и стороны треугольника, на которую падает эта высота\n";
    int high = 0, side = 0;
    std::cin >> high >> side;
    std::cout << "Площадь треугольника: " << triangle(high, side);
    return 0;
}